read_verilog FPU_PACK.v
read_verilog design.sv

hierarchy -check -top FPU_8

proc
opt
#TODO: synth without flattening everything
flatten
opt
memory
opt
fsm
opt

show -format dot -prefix netlist

write_verilog synthesized_design.v
